using System;
using System.Collections.Generic;
using System.Text;

namespace PeopleGenerator
{
    public class Address
    {
        public static readonly string[] streetSuffix = new string[]
        {
            "вул.",
            "вуліца",
            "праспект",
            "пр.",
            "плошча",
            "пл."
        };
        public static readonly string[] city = new string[]
        {
            "Мінск",
            "Гродна",
            "Гомель",
            "Брэст",
            "Магілёў",
            "Віцебск",
            "Юрацішкі",
            "Бабруйск",
            "Іўе",
            "Баранавічы",
            "Пінск",
            "Ліпнішкі",
            "Воранава",
            "Слонім",
            "Маладзечна",
            "Ліда",
            "Навагрудак",
            "Ашмяны",
            "Трабы",
            "Дарэні",
            "Лаздуны",
            "Дзятлаў",
            "Масты",
            "Полацк",
            "Парыж",
            "Ляпешкі",
            "Чарнэлі",
            "Дайліды",
            "Рэмбакаўшчына",
            "Сматра",
            "Бакшты",
            "Зубавічы"
        };
        public static readonly string[] street = new string[]
        {
            "Савецкая",
            "Маладзежная",
            "Цантральная",
            "Школьная",
            "Новая",
            "Садовая",
            "Лясная",
            "Леніна",
            "Кастрычнцкая",
            "Зяленая",
            "Камсамольская",
            "Зарэчная",
            "Першамайская",
            "Гагарына",
            "Палявая",
            "Лугавая",
            "Піянерская",
            "Кірава",
            "Юбілейная",
            "Северная",
            "Пралетарская",
            "Сцяпная",
            "Пушкіна",
            "Калініна",
            "Южная",
            "Калхозная",
            "Солнечная",
            "Жалезнадарожная",
            "Усходняя",
            "Завадская",
            "Чапаева",
            "Нагорная",
            "Берагавая",
            "Перамогі",
            "Горкага",
            "Кааператыўная",
            "Чырвонаармейская",
            "Саўхозная",
            "Рачная",
            "Школьны",
            "Спартыўная",
            "Азерная",
            "Паркавая",
            "Чкалава",
            "Мичурына",
            "Падгорная",
            "Пачтовая",
            "Партызанская",
            "Вакзальная",
            "Лермантава",
            "Свабоды",
            "Дарожная",
            "Дачная",
            "Маякоўскага",
            "Западная",
            "Фрунзе",
            "Дзяржынскага",
            "Маскоўская",
            "Свярдлова",
            "Някрасава",
            "Гогаля",
            "Чырвоная",
            "Працавая",
            "Шасэйная",
            "Чэхава",
            "Камуністычная",
            "Працы",
            "Камарова",
            "Матросава",
            "Астроўскаго",
            "Сасновая",
            "Клубная",
            "Куйбышава",
            "Крупской",
            "Бярозавая",
            "Карла Маркса",
            "8 Марта",
            "Бальнічная",
            "Садовы",
            "Інтернацыянальная",
            "Суворова",
            "Трактавая",
            "Ламаносава",
            "Горная",
            "Касманаўтаў",
            "Энэргетыкаў",
            "Шаўчэнка",
            "Вясенняя",
            "Механізатараў",
            "Камунальная",
            "Лясны",
            "40 лет Перамогі",
            "Майская"
        };
        private Random rnd = new Random();

        public string City()
        {
            return city[rnd.Next(0, city.Length)];
        }

        public string ZipCode()
        {
            return rnd.Next(100000, 999999).ToString();
        }

        public string StreetName()
        {
            return $"{streetSuffix[rnd.Next(0, streetSuffix.Length)]} " +
                $"{street[rnd.Next(0, street.Length)]}";
        }

        public string BuildingNumber()
        {
            return rnd.Next(1, 1000).ToString();
        }
    }
}
